[
  {
    "title": "[Acne] help fix my face before a date tomorrow!",
    "permalink": "https://www.reddit.com/r/SkincareAddiction/comments/1lfdl9g/acne_help_fix_my_face_before_a_date_tomorrow/",
    "pros": [
      "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! You can find even more skincare guides [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and if it is, we might remove your post). Everyone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :) *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
      "pimple patches 100%!! leave them on overnight & do not touch them anymore. The patches will help flatten them so that it’s easier to cover them if you wear make up. also do not overdo it on the products tonight, or else your skin starts to peel around the breakouts. keep it hydrating and gentle until after your date when you can actually treat it.",
      "best thing you can do is make sure your skin is exfoliated and very hydrated and smooth feeling so you can cover them really well with makeup",
      "I wish I wasn’t allergic to The Ordinary! Because when the allergy clears up my skin looks amazing 😂",
      "I just want to say this is almost my exact routine of products😂 only difference is I use the Kehils rare earth pore cleanser and I LOVEEE it along side these. It really makes my face feel clean and helps with texture/oil."
    ],
    "cons": [
      "I'm not going to ''fix your face'', but Adapalene is a potent retinoid, and you shouldn't be using it with a retinol serum or any other retinoid products. Do you know how to use it? If not, things are going to get a lot worse."
    ]
  },
  {
    "title": "Trying AB makeup brands!",
    "permalink": "https://www.reddit.com/r/AsianBeauty/comments/1lf59yi/trying_ab_makeup_brands/",
    "pros": [
      "Oml oml oml girl!!! You are absolutely gorgeous!! I see you placed your blush on the sides? Where cheekbones are. If you've got angular face I suppose it's one of the best placements for you. And a lil bit of blush on your nose too right above the tip, if you haven't tried yet. Keep slaying! 💕",
      "You did your makeup super well!! 🥰 Which prompt did you use for chatgpt?",
      "Oh wow OP you have amazing skin! Would you mind sharing your skincare routine? I'd appreciate it!",
      "Cutie pie alert!! That lip shade looks great on you! <3",
      "so pretty!! 🤩💛"
    ],
    "cons": []
  },
  {
    "title": "Is there anything non surgical I can do for this loose skin.",
    "permalink": "https://www.reddit.com/r/30PlusSkinCare/comments/1lfit0q/is_there_anything_non_surgical_i_can_do_for_this/",
    "pros": [
      "I have recently just tried a RF (radio frequency) facial & tbh the only reason I ended up doing it was because I always jump on any/all deals!! I never pay full price for facials, products, ect… so the deal was get 1 RF treatment for $199.00 & get it anywhere else on your body for free so I chose my face & abdomen. So now I officially have a membership because I seen such a huge difference on my stomach!!!! My face not as much but I think it’s because I really didn’t need it on my face but it did bring out my jawline a lot!!! They take before & after pics because they show you the difference that day… so I’m actually going Sat & doing my stomach again & with the membership I can go once every mnth so I’m going to alternate back & forth & do my abdomen then do what they call a butt lift. During my yr membership I might get my face done again but idk. But it must have done a whole lot of something for me to get a membership!! I’m not even a member @ my spa… so I would highly recommend looking into a RF skin tightening facial. It’s non surgical & it’s completely painless. Just make sure to drink tons of water before & after but definitely give that a try",
      "I think it doesn’t look like loose skin, it looks like you hold a lot of tension in your neck muscles. I’f I were you, I’d try to massage the area from your jaw down to your collarbones. Feel the muscles, and run your fingertips down the tissue, using some lotion. (Maybe look up the muscles: SCM, Scalenes, Platysma would be good places to start) Bonus points if you find someone to massage your traps and levator scapulae. I’d give it a try. Its for free and might feel super nice afterwards.",
      "I wouldn’t call this loose skin. Your skin just looks really dehydrated…probably exaggerated by the sunburn. Obviously wear sunscreen/hats, bc whatever you do will be negated by sun exposure. This is even more important if you use tret. Skincare: 1. Hydrate with toners (I love Korean toners and they’re affordable) 2. Use peptides 3. Snail mucin and a good moisturizer will go a long way. At home devices: 1. Red light therapy. Helps with a ton of skincare concerns including hydration and elasticity 2. Microcurrent. The ziip halo is amazing",
      "Besides the Tret & SPF, microcurrent device (foreo/nuface), lifting/training, other collagen building/supporting supplements. Possibly copper peptides in addition to microneedling. I’m just pulling out all the info I’ve seen on similar posts. Of course nothing will be super dramatic but you might see a little improvement! Good luck 🤍",
      "Hydrate, smooth, firm. (But wait until the burn is gone). Some great ingredients that do this are: Hyaluronic acid, peptides, and Vitamin C."
    ],
    "cons": [
      "Are you losing weight? Drink some salty water, aloe (maybe avoid getting burned) and strivectin. Maybe filler in your face to lift.",
      "Could also get kybella to decrease the weight pulling down but you might have more loose skin temporarily. You look young enough that you could tighten back up."
    ]
  },
  {
    "title": "A lip flip is Botox!?",
    "permalink": "https://www.reddit.com/r/30PlusSkinCare/comments/1lf7et7/a_lip_flip_is_botox/",
    "pros": [
      "I’m on team lip flip! First few weeks were weird but WOW I’m loving the balance I have in my face now. I’m wearing lippie like crazy now days because I finally have enough top lip to feel like it doesn’t look weird on me",
      "You definitely can go other places below the cheekbones too. The results are variable , but injecting into the front jawline, under the mouth, and the neck bands can soften and slightly lift the area ‘ Nefertiti neck lift’ . Best results are in slim people with strong platysmal bands which stick out For me personally I hated lip flip it felt horrible and I struggled with eating, spitting toothpaste etc. and didn’t look any better anyway. but other people love it. YouTube/ tik tok is great for learning about Botox injection points",
      "I actually love the lip flips. I have (naturally) weaker muscle one side of my face (like Madison Southern Charm) and my lip curls on one end, while other side is gummy. So the lip flip with yearly filler gives me a nice even smile. It’s great for some people, such as myself and horrendous for others.",
      "I used to get lip flips for my super thin upper lips, and they just didn’t do enough and wore off easily. So I decided to go for it and get filler in my upper last year. I couldn’t be more happy with the results. Very understated yet gave me the upper lip I always wanted.",
      "I love lip flips before a vacation or any time I’m going to be taking a lot of pictures. They’re here for a good time not a long time."
    ],
    "cons": []
  },
  {
    "title": "Beauty treatments (lashes, hair etc) somehow always subtract from me, but it never seems to have that effect on anyone else I see- what's up?",
    "permalink": "https://www.reddit.com/r/beauty/comments/1lfccin/beauty_treatments_lashes_hair_etc_somehow_always/",
    "pros": [
      "There is more than one type of beauty. Different vibes and aesthetics are suited to different people—it’s helpful to work with what you have, and know what compliments YOU. Maybe try thinking, what historical era or decade would I have been considered the most beautiful in? Which time’s ideals of beauty do I closest match with? Personally, I think I have an Italian Renaissance kind of beauty, or a pre-raphaelite kind of beauty, or maybe a retro classic old Hollywood-inspired beauty (think Audrey Hepburn or Sofia Loren). If I take some notes and cues and beauty inspirations from these, I look a lot better than if I just chase current trends (laminated brows was NOT for me, nor is the current “clean girl” aesthetic, nor would be a bleach-blonde Californian aesthetic. I would have been considered homely in the 1920s flapper era, that’s for sure). Dunno if this helps, but it might!",
      "There is no way 90% of people around you are all put together. Maybe you’re being mean to yourself. You’re probably the girl I see in the store and think damn I don’t have time for lash lifting or pretty nails. She looks great and I’m the bag lady trying to get fruit. It’s easy to notice flaws on yourself. Sometimes treatments increase that focus on one area in a not good way. All you see is your “flaw” there, but in other people you see “Wow, she’s a beautiful whole being!” Why can’t you see that in yourself? I’m sure you’re a beautiful person who just hasn’t seen it yet.",
      "Keep in mind that most girls you see who look seemingly perfect (online, and in real life) are using filters, contouring, heavy hair products, wigs, etc. and are likely putting a lot of effort into their appearance. You’re not seeing them while they’re lounging around the house on a Sunday. I know what you mean though and I feel the same way. I think the reality is that most professionals in the beauty industry just don’t know you and your own features the way that you do. Unless someone is exceptionally talented, they’re likely taking a one size fits all approach in their work. When it comes to knowing what styles, colors, shapes etc. are the most flattering for your specific features, you’re probably the most experienced expert (if you’re someone who pays attention to beauty and aesthetics).",
      "My theory is that those people are very, very picky and will keep an eye on the progress of things and point out things that they want fixed as the process goes on. It's not a bad thing (as long as they're not being overbearing); it's how they ensure they get the exact result they're looking for from a professional service. If they also go to the same people as a returning client and tip well and aren't too hard to work with, the person will ensure a consistent outcome per the client's exacting tastes.",
      "I feel this with lashes and nails. I have downturned hooded eyes and flared nail beds that both look weird when you apply the “standard” technique to them. I shopped around for lash/nail techs who can get it right but now I am happiest doing things mostly myself. I shape my own nails before I get my acrylic overlay filled for $25, and I have a go-to primer/mascara/eyeliner combo that is consistently flattering."
    ],
    "cons": [
      "I have no answer, but the same thing happened to me yesterday - I even said to my husband, aren't I supposed to look cuter when I get home from the salon, not worse? Honest to god, I think I look better when I chop my own bangs and do my own damn nails (which were ruined at the most expensive place in town). ALSO to add insult to injury, I had to have my passport picture taken yesterday so I've got to look at that hot mess for 10 more years.",
      "I find it impossible to believe that you go to the best salons and get terrible service each time while everyone else comes out looking perfect. I get mistakes can occasionally happen but there is no way it happens 100% of the time. Especially when you change where you go and who you see. I would need to see before and after pictures of each visit before I believe this. It seems statistically impossible and no I don't think everyone who is in business to satisfy their customers are somehow sabotaging you. Either its in your head or you are lying."
    ]
  },
  {
    "title": "Tret SAVES LIVES",
    "permalink": "https://www.reddit.com/r/tretinoin/comments/1lez2oi/tret_saves_lives/",
    "pros": [
      "Your skin looks phenomenal! Great job and love your routine.",
      "Your skin looks absolutely amazing, congratulations!",
      "Beautiful! I'm so happy for you!",
      "Congratulations! Your skin now looks fantastic!",
      "I love this for you! You are radiant!"
    ],
    "cons": [
      "There's no way wow . How long did it take to see noticeable results"
    ]
  },
  {
    "title": "[MOD] The Daily Question Thread",
    "permalink": "https://www.reddit.com/r/Coffee/comments/1ldj65o/mod_the_daily_question_thread/",
    "pros": [
      "Hi, I've recently started using the aeropress I bought 5+ years ago. I've mostly drank keurig and nespressos since I stopped drinking tims and drip coffee. Basics of what I have going hardware wise is a sboly conical 19 grind setting grinder, a crappy kettle that I've recently cleaned with vinegar and rinsed very thoroughly at the start of this journey. The first bag of beans I decided to buy was a washed Ethiopian with tasting note of rose, peach lemonade, and apricot jam. From what I gather, this would be higher in acidity, less bitter, lighter flavor than almost anything, or the lightest I've ever had before. Am I correct in saying that acidity can come off as sour to underdeveloped pallets? This brings me to the grinder. The grinder was given to me with some beans still in the hopper. I tried a cup of that from the areopress and it was extreamly sour. I'm guessing this is due to the old age of the beans and being out in the open in the hopper for likely months. I cleaned out the grinder what I knew I could at the time, I didn't want to break it. I started using the bad of beans I bought and it was coming out very sour still. I this reduced over the next few cups as the old stuff came out more. Then I got more brave and discovered how to open it up and remove the top burr and was able to clean it out a lot better using a air can to use on computers to blow stuff out even better. I've ended up reducing the grind setting to 4 from the finest. For my brew method with the aeropress, as you may have guessed, im using the James Hoffmann method. I'm doing 12g coffee 200g ish usually a bit more because I'm bad at pouring but never less. 2min wait, swirl to break the crust, 30s wait, press gently and slowly aim for 30s press time. The water I've been using has been boiling on the bottom of the kettle as I pour, as I think you want as hot as you can for light roast? I'm using carbon filtered water from an aqua gear filter. Now with the grinder as clean as I think I can get it with what I think is a good grind setting and I think a good technique, its still a bit sour. This sour is far far more enjoyable than that of the old leftover bean. I've run around 200g of this new bean thru the grinder so far. My question is, might the sourness I'm tasting be from the bean selection and the roast? Or might I need to do an even deeper clean of the grinder? Maybe I'm messing up a step somewhere else? Maybe I'm doing everything right and it's all hunky dory? Thanks! Edit: I should add that before I received this grinder that I got a bag from a local roaster and had them grind it for me fresh. It was a medium roast with surprisingly no mention of anything on the bag other than their name. It was fairly coarsely ground like coarser than folders I'd say. I did tell them I'd be using an areopress and they said their grinder had a button for that so I dunno. Anyway the point of this is that there was no sourness coming from that bag at all and it was definitely more of the traditional dark earthy coffee kind of flavor.",
      "I want to make better coffee, but I don't truly know where to begin, because I think I treat it differently to most coffee drinkers. I currently have been using ground coffee in a moka pot that I got as a gift from work for my five-year anniversary. [This guy.](https://www.amazon.com/London-Sip-Stainless-Stove-Top-Percolator/dp/B09X1ZJKMP) As a way to occasionally make one single cup of coffee, it works for me. I don't drink coffee regularly and only brew for one of three reasons: I decide to make one because I decide I would like the caffeine or I just feel like having a coffee; I am making mixed drinks (like espresso martinis or carajillos) and need it; or I have a guest who asks for some. However, relying on pre-ground coffee hasn't been ideal. I brew it so irregularly (maybe once or twice a month) that the grounds just sit around in an airtight bag for a long time. I also have some nice beans I've picked up on travel that I want to make the most of, so I bought [the hand grinder](https://www.amazon.com/dp/B01LXZACFB) recommended in the wiki here that's under $50. Which circles back to the moka pot. I like how it works, and its ease--I fill the reusable filter with grounds, and the bottom cavity with water. And then I just leave it on a burner until the coffee is finished brewing. But I also find a lot of the time it's burned my coffee despite me following the directions directly, and the build quality, while fine, feels cheap and unlikely to last. Should I replace the moka pot? What should I do about the coffee getting burned?",
      "Looking into replacing my manual ceramic burr grinder for something better (and affordable) that is (hopefully) available in my country, though I don't mind importing one if it's of high quality. I've been looking into getting a Timemore grinder. Are there any real differnces between the C2 (and its variants like the chestnut) and the C3 (and its variants like the C3s)? They all appear to be a similar price. I usually grind larger batches to brew coffee for at least 3 people (i.e. 30-36g on a french press) but mostly use an Aeropress for my personal cups of coffee. I am not neccessarily looking for an espresso capable grinder, but it would be a nice to have. Thanks in advance :)",
      "'m looking for a **Zojirushi** mug/bottle to hold coffee during my shifts at the office. I'm torn between the **SM-SF48, SM-ZB48 and SV-GR50**. I've heard that the mugs keep the coffee hot for so long that it's hard to drink straight from the mug, so I am leaning towards the SV-GR for the cup. Everybody on Reddit is praising the SM-S mugs, but I've not heard anything about the SV thermoses. Does anybody have experience with the SV-G or SM-Z lines and could share their thoughts? Are they as good at keeping temperature as the more popular mugs? Would it be comfortable to drink straight out of an SV-GR (for example, in a car, where pouring into the cup is not ideal)?",
      "I just upgraded my coffee setup - a D40+ grinder and a breville bambino. What should be my optimum settings be? What should I do to achieve that honey-like flow? I am currently at 5.5 and my extraction took about 35ish seconds and have me 46gms of Espresso. I don't hate it but I think I can do better. Please help, thank you!"
    ],
    "cons": [
      "Hi! My boyfriend wanted to do the dishes for me, without remembering how I clean the moka pot, he decided to use the scrub daddy and soap on it 😫 what do I do?? Is it deemed a loss and I throw it out or do I keep using it? I’m more worried about the abrasive being used than the soap. Thank you!"
    ]
  },
  {
    "title": "Cheapest and most nutritious meal",
    "permalink": "https://www.reddit.com/r/EatCheapAndHealthy/comments/1lfhxj4/cheapest_and_most_nutritious_meal/",
    "pros": [
      "It’s always rice and beans. Here’s what I do Cook down 8 oz each of diced onions and bell peppers in a deep pan with olive oil and whatever spices you like. I do garlic powder, paprika and pepper. But a spice blend is fine if you enjoy it. Add 1 cup of rice, 2 cups of stock, a can of beans, 8 oz of diced carrots, a can of corn and add hot sauce salsa here if you like spice. Cover and simmer on low until rice is cooked. Stir every 10 minutes or so. Makes 4 huge servings that are filling and healthy. Use low sodium options if possible.",
      "I ran the kitchen for a barbecue restaurant in my 20s. I wrote down all of their side dish recipes before I left and have no issue sharing them now that the restaurant doesn't exist any more. One of my favorite recipes from there is this \"Three-bean chili\". It's vegetarian and is actually better as leftovers since the flavors have time to meld together. We often eat it on baked potatoes. The full recipe uses the ingredients on each line. Because it's restaurant sizes, I typically cut it in half with the amounts in parenthesis 1½ c. Bulgar (3/4 c) 2 c. Orange Juice (1 c) 1 c. Canola and Olive oil, mixed (1/4 c of each) 2 qt. chopped yellow onions (1 qt) ½ c. chopped garlic (1/4 c) 1 c. chili mix (1/2 c) 1½ T salt (3/4 T) ½ #10 can crushed tomatoes (3 c) 2½ T Mirepoix in #10 can of water (6 c) 3 diced sweet red peppers (1.5) 2 qt frozen green beans (4 c) 1 qt frozen corn (2 c) ½ #10 can red kidney beans (3 c) ½ #10 can garbanzo beans (3 c) Soak the orange juice and bulgar together until all liquid is absorbed (typically 1+ hours). Once ready to cook, cook the onions in the oil until translucent, then add the garlic and cook for a few minutes. Add the bulgar mixture and chili mix and stir for one minute. Add the salt, tomatoes, and water, then bring to a boil. While waiting to boil, dice your red bell peppers and drain the liquid from your beans. Add the remaining ingredients and continue cooking.",
      "Canned fat free refried beans, mashed sweet potato, shredded cheese, frozen corn, salsa. Chickpea salad (chickpeas, red onion, frozen corn, Balsamic dressing, chopped olives, feta cheese) on a whole wheat pita. Mix in canned chicken for extra protein. Tuna casserole (whatever pasta you like, canned tuna, frozen peas, fat free cream of mushroom soup, low-fat cheddar, no butter).",
      "Moms cookin’ is free and always makes me feel better.",
      "Chili by far. Dried beans are like $2 a pound, spices $1 (per batch), fresh onions, chilis, and garlic ~$3, can of tomatoes is ~$2. - Total: $8 - Total per serving: $1.00-$3.00 (depending on serving size) Optional add ins, Costco rotisserie chicken ($5), sour cream (~.50 per serving), cheese (~.50 per serving), cilantro (~.10 per serving)."
    ],
    "cons": []
  },
  {
    "title": "I've been dry brining my steaks for a few years now and decided to take a before and after. I was actually shocked at the visible difference.",
    "permalink": "https://www.reddit.com/r/Cooking/comments/1lfgdcb/ive_been_dry_brining_my_steaks_for_a_few_years/",
    "pros": [
      "While I encourage people to experiment, because it is really interesting what a difference salt and time can make, imo and all a fully salted steak is decidedly worse. It'll depend on doneness too. Fully salted will tenderize, which can help with fully cooked or close to steaks.",
      "So cool and the transformation is impressive.",
      "the color is so vibrant!",
      "A few years is too long to dry brine. Maybe just for a few hours or overnight is best",
      "I now dry brine any beef or pork that's thicker than 1/2 an inch. Try next time you're making a roast, it really improves it!"
    ],
    "cons": [
      "This is a strange hill to die on, but I hate the term \"dry-brine\". We could just say \"salt heavily and dry refrigerated.\" To make matters even more confusing, I've even heard of a \"wet-dry-brine\" which is typically used on seafood. It's like the old school salt crust baked fish, except you wash it off before cooking. At least we don't call a dry rub a \"dry-marinade\" .... yet."
    ]
  },
  {
    "title": "How crucial does gut health affect mental health?",
    "permalink": "https://www.reddit.com/r/nutrition/comments/1lezhlb/how_crucial_does_gut_health_affect_mental_health/",
    "pros": [
      "Absolutely crucial. Now when shit gets tough, chronic pain flares up, even though I control all my macro and micro variables for what I eat, main thing what I always do and recommend to friends and family members- get fucking lean and drop as much fluff as possoble. And it always works incredibly well. Fix the nutrition and start doing the hard yards- training, whatever that will be. Step by step and build. Then look at sleep and recovery. Optimze that. Stay there. Make uncomfortable feel comfortable because you are doing the right things which will pay dividends down the line. Now this is just a few thoughts while im doing my cardio 1hr15min in already and thinking to do a bit more. Also Elimination works the best because we as humans and society have become nothing else but users and consumers day in and day out. So less is more and i guarantee you, your mental health will be way way better after you ticked all those boxes. Now im not sure perhaps u already there and looking just to level up then there are different things to do but overall this is a great blueprint to get your mental heath up and overall health up. I probably forgot plenty of other important things that add up but hopefully you can get something from this. Best of luck and hang in there. Better days are not far away...if you are willing to do the hard yards. Peace ✌🏼",
      "There is literal neuronal lining down there, so it's no joke when they say second brain, and all the dietary stuff has to be filtered through a new lens for where mental or psychiatric medicine might not be helping people this might hold answers - and then there's how things are metabolized, but anyway. A curious thing about \"trust your gut\" is that like with hearts synching in bed between couples, the gut does something similar before any chemical thing between people, and doesn't have language like the brain does, so when they say \"trust your gut\" with someone, that really can lie or be lied to - and there are probably diets that can factor in to how clouded or clear that might leave people. It's fascinating stuff, really!",
      "Remember, it's not just food that influences gut health. Lifestyle changes such as exercise and better sleep will have a non-trivial effect, too. It's honestly fascinating—the brain and body go through a great many \"handshakes\" every day without you knowing. For anyone looking to learn more, I recommend \\[this page\\](https://www.health.harvard.edu/diseases-and-conditions/the-gut-brain-connection) by Harvard Health, and \\[this article\\](https://www.nature.com/articles/s41598-025-86858-3) published by nature.",
      "If you would like a good example of gut impact on mental health, try taking some activated charcoal before bed and monitor the improvements to mental clarity and wellbeing the next day. Small doses of penicillin and distilled white vinegar can promote a similar state",
      "Omg it plays a MAJOR role. It’s like putting diesel in a gasoline car and expecting it to run smoothly. Or at all. What you eat (devour, etc) impacts your gut and that impacts your mental health. Your gut is also affected by sleep, or lack of it, zinc deficiency, vitamin d3 deficiency and more. Dm me if you want more information lol. This is what I specialize in to be honest"
    ],
    "cons": [
      "I've seen a lot of evidence that it plays a major role. There are studies linking gut health to mental illness and/or recovery from it. There are studies of using gut-based treatments including probiotics and dietary changes to treat depression and other mental health conditions. It's poorly-understood, but the preliminary evidence seems to suggest the effect is potentially large. There are many different potential mechanisms, including: * Poor gut health just leading people to feel bad due to unpleasant symptoms, which is an additional stressor that can worsen mental health * Poor gut health blocking absorption of nutrients, leading to deficiencies that can worsen mental health * Poor gut health resulting in the creation and/or absorption of toxins and/or other harmful compounds which can negatively effect mental health * Good gut health facilitating absorption of nutrients, and even synthesis of those nutrients in the gut * Good gut health (esp. through high fiber intake) resulting in more stable blood sugar which stabilizes mood swings * Gut health modulating the immune system, and infections elsewhere in the body then influencing mental health There may be some more mechanisms I forgot, and there are also likely many mechanisms that haven't even been discovered yet. Also, anecdotally, in my own life, how I eat seems to play a big role in my mental health. Also, the relationship between gut health and mental health is likely bidirectional. Gut health influences mental health, but mental health also influences gut health. Again, there are multiple mechanisms through which this can happen: * Poor mental health elevating stress level which reduces the \"rest and digest\" nervous system, thus harming gut health. * Poor mental health increasing cravings for unhealthy foods, disrupting gut health. * Poor mental health leading to more disordered eating habits, similarly disrupting gut health. * Poor mental health suppressing or weakening the immune system, thus increasing the risk and/or severity of infections in the gut. * Good mental health making people think more rationally about diet and eating, thus improving gut health. * Good mental health making people be more on top of their life so that they have more resources with which to eat healthier. So basically both the gut and the brain are parts of systems that are interconnected in multiple ways, and a healthy state in one helps keep the other in a healthy state too.",
      "#### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*",
      "Long story short, i have gut dysbiosis (verified by stool samples over, and over, and over) caused by antibiotics and covid (this is not uncommon). I can say with 100% certainty that mental health and happiness are tied to gut health. I have suffered from anxiety, depression, panic attacks, and more as a result of my poor gut health.",
      "It's very crucial! Based on studies, poor gut health is linked to anxiety, depression, anxiety, even Alzheimer's! Leaky gut can lead to inflammation, and inflammation can lead to impaired focus. Also, a healthy gut helps regulates the stress hormone cortisol.",
      "When I have to shit all the time it's annoying and affects my mental health negatively lol"
    ]
  },
  {
    "title": "Post Exam Prep",
    "permalink": "https://www.reddit.com/r/MealPrepSunday/comments/1lf4w5q/post_exam_prep/",
    "pros": [
      "Super clean, nice way to reset after the big tests. I've only just started toying with quinoa, do you use just as much stock as you'd normally use water?",
      "this is plated so nicely - i am inspired, i kind of just stack/pack stuff"
    ],
    "cons": []
  },
  {
    "title": "Thurs-Fri",
    "permalink": "https://www.reddit.com/r/MealPrepSunday/comments/1leu6se/thursfri/",
    "pros": [
      "Nice prep! Enjoy!"
    ],
    "cons": []
  },
  {
    "title": "How do you decide what to meal prep each week",
    "permalink": "https://www.reddit.com/r/MealPrepSunday/comments/1lf1w2e/how_do_you_decide_what_to_meal_prep_each_week/",
    "pros": [
      "I’ve been using Chat GPT to help with my meal planning the past month or so. I put in what style of cuisine I want to eat for the next two weeks, i.e.; Asian, Comfort Food, Mexican, etc., what type of proteins to use, and have it generate not only a list of recipes, but also put those recipes into a rotation where I never eat the same thing twice in a row. I meal prep for both lunch and dinner, so this is definitely a bonus. I also have it adapt the recipes to my instant pot and slow cooker, which makes clean up a breeze. Here is a sample of what I’ve input and received for the next two weeks, and the recipe rotation. My input: Make a rotating recipe list for lunch and dinner the next two weeks using these ingredients: Boneless chicken breasts Smoked beef sausage Cream cheese Shredded Colby Jack Frozen mixed vegetables Pinto beans Canned whole kernel corn Green beans Diced tomatoes with green chilis Hummus Low carb tortillas Fresh diced tomatoes Bell pepper strips Celery sticks Fresh jalapeño’s Enchilada sauce Jasmine rice ChatGPT results: Here’s a 2-week rotating recipe plan for lunch and dinner using the ingredients you listed. Each meal is diabetic-friendly, balanced, and makes the most of your pantry and freezer without needing extra shopping. ⸻ WEEK 1 Monday • Lunch: Chicken Veggie Wraps – Sauté diced chicken, frozen mixed vegetables, and bell pepper strips. Season lightly. Add shredded Colby Jack and wrap in low-carb tortillas. • Dinner: Sausage & Pinto Bean Skillet – Slice smoked sausage and pan-fry with pinto beans, green beans, and a spoonful of diced tomatoes with green chilis. ⸻ Tuesday • Lunch: Celery & Hummus Snack Plate – Pair celery sticks, bell pepper strips, and jalapeño slices (optional heat) with a generous serving of hummus. • Dinner: Enchilada Chicken Bake – Layer cooked chicken, enchilada sauce, cream cheese, shredded cheese, and diced tomatoes with green chilis in a baking dish. Bake until bubbly. ⸻ Wednesday • Lunch: Pinto Bean & Corn Salad Wraps – Mix canned corn, pinto beans, fresh tomatoes, and bell peppers with light seasoning. Wrap in tortillas. • Dinner: Smoked Sausage Stir-Fry – Sauté sausage with mixed vegetables and jalapeños. Serve over jasmine rice. ⸻ Thursday • Lunch: Chicken Jalapeño Roll-Ups – Mix shredded chicken, cream cheese, jalapeños, and Colby Jack. Spread on tortillas and roll up. Chill and slice. • Dinner: Tomato & Bean Rice Bowl – Cook jasmine rice. Top with pinto beans, diced tomatoes with green chilis, sautéed green beans, and sprinkle with cheese. ⸻ Friday • Lunch: Low-Carb Sausage Lettuce Tacos (if you have lettuce) – Or use tortillas. Fill with sausage, corn, and veggies. Top with fresh tomatoes and jalapeños. • Dinner: Creamy Chicken Veggie Skillet – Cook chicken, stir in cream cheese and frozen vegetables. Add Colby Jack for a creamy finish. YMMV and good luck.",
      "I like to pick 1 soup, 1 casserole/rice dish, 2 proteins (that I either make a salad of heat up canned veggies with), and a pasta sauce of some kind. What recipe of each varies week to week depending on sales and ingredients I have but I make sure to check off each of those boxes. (Note: I'm ADHD so my method of \"loosely planned/organized\" may not work for you. I just work better with broad categories to check off and lots of creative wiggle room to work with. Lol)",
      "I save recipes I like or am interested in (I use Paprika). I'm in some different cooking subs and I browse food blogs, cookbooks etc to find stuff that sounds good and download the recipe. When it's time to go shopping I check what's on sale and try to plan around that as well as what produce is in season, what my husband and I want to eat, what we already have in the freezer/pantry, etc.",
      "I keep a list of things I've made in the past that I enjoyed eating and would eat again. But that list has some organization to it. Categories like: Meatless, High Protein, Low Calorie, Low Time Commitment, Salad, Soup, Pasta, Lasts Long Time in Fridge, Assembly Required etc. This is normally the type of stuff I consider when I think about what I want to prepare for the week. It also gives me a good idea if my recipe count is lagging in any area. In addition to categories, I also have ingredients per recipe recorded along with reasonable substitutions. There are times when I have an excess of some kitchen staple or something is expiring and I need to use it soon. So I'll search for that ingredient to quickly figure out what I've used it for in the past. This is also helpful for weeks when you might need to budget a bit more tightly and pull from your staples as much as possible. The hard part of course is building that list. It just takes time. I've used Hellofresh as a way to try new things with little hassle. And sometimes I just find a meal prep series on YouTube and pick one that doesn't seem too hard. Just be sure to carve out time somehow to add to your list.",
      "We have a rotation of recipes. I have a coworker who loves to experiment with cooking and she tells me when she finds a good one and shares. We are an ingredient household so sometimes it’s just experimenting with what we have on hand. I’ve also used AI and said I have x, y, z for ingredients what can I make for however many people. Almost all of my lunches are experiments."
    ],
    "cons": [
      "I buy 2 weeks of groceries at a time, and while making my list i spend an hour or so furiously scrolling pinterest (feed and boards) and my past meal lists for ideas",
      "My family (since I tend to make most/all the food and thus all the food decisions) is about to start using a roulette wheel tbh. We'll put up recipes that everyone enjoyed and spin so it takes some of the burden of Choice off of my hands because gods DECIDING WHAT TO EAT EVERY WEEK SUCKS!! There are also going to be a few slices for \"try a new recipe from xx source\" or whatever."
    ]
  },
  {
    "title": "My testosterone has gone from 700 in 2018 to now 297 in 2025. More than 50% reduction. My vitamin D is 28 - 32M. Suffering chronic fatigue and trauma symptoms.",
    "permalink": "https://www.reddit.com/r/Supplements/comments/1lf3rr0/my_testosterone_has_gone_from_700_in_2018_to_now/",
    "pros": [
      "Do not go on TRT immedietly. That should be a last resort because once you go on it there is no going back, as your body will shut down its natural testosterone production. You should try Tongkat Ali and Cistanche first. Both boost testosterone, and both have adaptogenic properties; meaning they can help with stress and typically anxiety as well. Try them one at a time, and you should add in 5mg of Pregnenolone as well. You could also try Shilajit (be careful a lot are fake), Ashwagandha (cycle it), DHEA, Zinc, and/or Boron. Tonkgat+Cistanche+Shilajit+DHEA+Pregnenolone is a very potent stack that all pair very well with eachother. Furthermore, if you do take Vitamin D3, it's best to take it with K2 and for most with Magnesium as well. You shouldn't just take D3 on its own. Make sure you're also eating healthy and getting enough vitamins and minerals. Taking a B-Complex could be beneficial. Additionally, for trauma Polygala is typically a game changer for most. It's best taken at 100mg dosed 3 times throughout the day, for a total of 300mg, but you can just do 50-300mg dosed once in the day if you wanted to. You could also try Gotu Kola, an incredibly potent anxiolytic (anti-anxiety) herb; Holy Basil, a very calming herb that can help with anxiety, plus it is an \"adaptogen\", so it can help with stress; Sarcosine, a chemical already found in the body with natural antidepressant effects; or Saffron, a very potent mood booster with antidepression and anti-anxiety properties. If budget isn't as much of an issue, or you're just going to take 1-3 things or so, SAM-e could potentially be of great use too, which like Sarcosine is already found in the body. If your SAM-e levels are low, you're not going to be able to cope with stress very well at all. It is also a mood booster, can improve cognition, anti-anxiety, may boost energy, and can do other various things potentially as well. I'm currently taking it and it helps, but it's like ~50/50 whether it works for someone or not.",
      "Hey man, really sorry to hear what you're going through — that's a massive drop in testosterone and the symptoms you're describing definitely line up with what a lot of people report when their T levels tank. Chronic fatigue, depersonalization, looping thoughts — it's brutal, and low vitamin D doesn’t help either since it's tied to hormone function and mental clarity. You might want to look into natural support while you wait for further testing. I was in a similar place (low energy, brain fog, poor recovery from stress), and what helped me was focusing on **natural testosterone support** — not just physically, but for mental balance too. Two supplements that stood out for me were **Tongkat Ali** and **Turkesterone**. There’s a UK-based brand I found called [**Vegishake.co.uk**](https://www.vegishake.co.uk/shop/) — they do clean, no-filler **organic supplements** and their [**Tongkat Ali capsules**](https://www.vegishake.co.uk/shop/) are specifically aimed at supporting **testosterone levels**, energy, and recovery. They also stock **Turkesterone**, which a lot of guys in fitness and mental wellness communities are turning to as a natural anabolic and adaptogen for **hormonal balance** and **performance** without synthetic hormones. Might be worth looking into while you wait on your cortisol and thyroid tests — supporting your body naturally while you figure things out medically can sometimes give that extra edge. Sending strength, hope you find answers and start feeling like yourself again soon.",
      "Also just to add — your **vitamin D levels at 28** are really low and could absolutely be playing a role in how you’re feeling, especially when it comes to **fatigue, mood, immune function**, and even **hormonal balance** like testosterone. I’d recommend checking out [**Vegishake’s high-strength Vitamin D3 supplement**](https://www.vegishake.co.uk/product/vitamin-d3-51000-iu-capsule/) — it’s a **massive 51,000 IU per capsule**, so you only need to take **one capsule per week**, which is way easier to manage than daily dosing. A lot of people don’t realise how important proper dosing is when recovering from deficiency. But — and this is important — it’s best to **take Vitamin D3 with Vitamin K2** to help direct calcium properly into the bones and prevent build-up in the arteries. You can either pair the D3 with Vegishake’s [**Vitamin K2 MK-7**](https://www.vegishake.co.uk/product/vitamin-k2-mk7/), or just go for their [**combined D3 + K2 formula**](https://www.vegishake.co.uk/product/vitamin-d3-and-k2-mk7-capsules/), which makes things easier if you want an all-in-one option. I found it helpful not just for physical health, but also to support **mental clarity and stress resilience**, especially while addressing trauma and low T. Hope this helps in some way.",
      "Very sorry about your trauma Hopefully you are also seeing a professional to talk through the trauma and heal. You did not say how old you are but 297 is extremely low Testosterone levels even for someone my age at 68 I am on testosterone therapy with a Dr and my levels are in the 900 range. A good vitamin D supplement should help with your vitamin D levels. Diet and excercise are also beneficial Best of luck to you.",
      "Looping thoughts sounds like pure OCD to me. I believe OCD is part of the reason I had low T, because I couldn't sleep anymore with all the anxiety it was causing me. I tried everything naturally to fix my sleep and raise my T, but nothing worked. It even got worse because I was overtraining on basically no sleep. I was taking sleeping pills every night, and feeling like a damn zombie. Finally convinced my doc to put me on TRT. It fixed almost everything, my sleep is very good now, good energy. I still have OCD and looping thoughts, but now I have energy and motivation to deal with it and to learn to live with it. TRT could be a solution for you, ask your doc. Good luck and don't give up, being low T with no sleep was the worst part of my life, but it does get better."
    ],
    "cons": [
      "Rules of r/supplements 1. Do Not Suggest Prescription Drugs Posts & Comments Reported as: Do Not Suggest Prescription Drugs Prescription drugs are not Supplements; do not recommend prescription medication. Sensible/Suggest talking to DR. can be allowable etc 2. Dangerous Grey Area Substance Posts & Comments Reported as: Dangerous Grey Area Substance Potentially dangerous grey area substances can not be recommended. 3. Be Polite Posts & Comments Reported as: Rude/Personal Attacks You shouldn't ever be personally attacking another user in this subreddit. 4. No Advertisements Posts & Comments Reported as: Advertisement. No selling / buying / trading posts No advertisements. No selling/trading posts between users.” *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Supplements) if you have any questions or concerns.*",
      "Anxiety - adrenaline dumps - high cortisol - cortisol suppressing your T levels. I went through a rough patch of DPDR/anxiety/panic attacks and my test levels were sub 300. Fixed my anxiety and got everything back to normal and test levels 792. It's a vicious cycle.",
      "Have you taken any particular supplements since 2018 , minerals magnesium , adaptagens like ashwagandha , vitamins with choline , fat burners , pre-workouts etc ? Sometimes there are things that creep up on us from right under our noses and cause damage. i recently found out i'm sensetivie to choline and have been taking it almost every day for years and it damaged my neurotransmitters really bad.",
      "Low D can cause low T and SO many other problems",
      "Not a doctor, but… Panic attacks can be a sign of high cortisol, and you might be dealing with chronically elevated levels. High cortisol is often linked to low testosterone. Low vitamin D could also be part of the picture, not getting enough sun (which is common for people with anxiety) and not eating enough vitamin D-rich foods can both contribute. I’d suggest getting some bloodwork done, including cortisol levels. TRT might be an option if your doctor thinks it’s appropriate. But again, I’m not an expert, don’t take this as medical advice, just something to look into with a professional."
    ]
  },
  {
    "title": "Help, nothing working!!",
    "permalink": "https://www.reddit.com/r/Supplements/comments/1lfk1bw/help_nothing_working/",
    "pros": [
      "So there are a couple of things to consider. First of all, no supplement will have a greater effect than a healthy lifestyle. How much do you exercise? Is your diet balanced and healthy? Do you have any conditions or diagnoses, like ADHD? Have you checked your genes (COMT, BDNF, etc.)? We can discuss the supplements afterward if you want a good discussion. :)",
      "There's the tocotrienols and then there is the tocopherols and each of them have a alpha, beta, delta and a gamma form to them. And they are all crucial to good health, especially our brain and heart health.",
      "What about protein and your oils? Especially the different forms of Vitamin E. Diet? Glucose spikes are what leads to sluggishness etc...there are a lot of things on your list I would eliminate in favor of what I mentioned."
    ],
    "cons": [
      "Rules of r/supplements 1. Do Not Suggest Prescription Drugs Posts & Comments Reported as: Do Not Suggest Prescription Drugs Prescription drugs are not Supplements; do not recommend prescription medication. Sensible/Suggest talking to DR. can be allowable etc 2. Dangerous Grey Area Substance Posts & Comments Reported as: Dangerous Grey Area Substance Potentially dangerous grey area substances can not be recommended. 3. Be Polite Posts & Comments Reported as: Rude/Personal Attacks You shouldn't ever be personally attacking another user in this subreddit. 4. No Advertisements Posts & Comments Reported as: Advertisement. No selling / buying / trading posts No advertisements. No selling/trading posts between users.” *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Supplements) if you have any questions or concerns.*",
      "Magnesium Glycinate isn't going to help your brain fog. When I took it it made me tired/mentally tired even the day after taking it which is why I stopped. Maybe you are reacting the same."
    ]
  },
  {
    "title": "Which Fish Oil Should I Take?",
    "permalink": "https://www.reddit.com/r/Supplements/comments/1lfmz0f/which_fish_oil_should_i_take/",
    "pros": [
      "If i am correct, DHA fish oil is a good option due to its strong regenerative ability. I don't know for sure.",
      "Whichever one doesn’t smell like low tide when you burp is the real winner"
    ],
    "cons": [
      "Rules of r/supplements 1. Do Not Suggest Prescription Drugs Posts & Comments Reported as: Do Not Suggest Prescription Drugs Prescription drugs are not Supplements; do not recommend prescription medication. Sensible/Suggest talking to DR. can be allowable etc 2. Dangerous Grey Area Substance Posts & Comments Reported as: Dangerous Grey Area Substance Potentially dangerous grey area substances can not be recommended. 3. Be Polite Posts & Comments Reported as: Rude/Personal Attacks You shouldn't ever be personally attacking another user in this subreddit. 4. No Advertisements Posts & Comments Reported as: Advertisement. No selling / buying / trading posts No advertisements. No selling/trading posts between users.” *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Supplements) if you have any questions or concerns.*"
    ]
  },
  {
    "title": "Why do I feel great the morning after drinking a lot?",
    "permalink": "https://www.reddit.com/r/Biohackers/comments/1lfe41n/why_do_i_feel_great_the_morning_after_drinking_a/",
    "pros": [
      "Thanks for posting in /r/Biohackers! This post is automatically generated for all posts. Remember to upvote this post if you think it is relevant and suitable content for this sub and to downvote if it is not. Only report posts if they violate community guidelines - Let's democratize our moderation. If a post or comment was valuable to you then please reply with !thanks show them your support! If you would like to get involved in project groups and upcoming opportunities, fill out our onboarding form here: https://uo5nnx2m4l0.typeform.com/to/cA1KinKJ Let's democratize our moderation. You can join our forums here: https://biohacking.forum/invites/1wQPgxwHkw, our Mastodon server here: https://science.social and our Discord server here: https://discord.gg/BHsTzUSb3S ~ Josh Universe *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Biohackers) if you have any questions or concerns.*",
      "Welcome to the revelation that just gives you more questions than answers. r/hangovereffect There is a big community of people, who tend to be neurodivergent, that feel this way. My personal experience was being aware since college that after a night of low-medium drinking, sometimes the next day my brain fog would be gone, my energy levels were great, and my body fat felt lean (as in water retention bloating gone). A veritable panacea! I thought for many years 'this is probably why people become alcoholics'. then I stumbled across the Hangover Effect community and it was a revelation. There are a number of theories in the community",
      "Lol this is me..its also nice not getting hangovers, I've also always been the happy drinker..",
      "You're still buzzed. But also, there's a sub I ran into on Reddit that's about people who always feel great the day after drinking. I can't for the life of me remember the name. You may get some extra info there.",
      "1) You have congestive heart failure and the alcohol serves as a diuretic allowing you to breathe better once you lose fluids and blood volume. (Measure your weight each morning.) 2) You already measure your weight each morning (for aesthetic reasons) and it’s lower after your drink… because alcohol is a diuretic. But then you gain water weight back later that same day. Regression to the mean. 3) any bipolar in the family history? Look up Hypomania. Also could be ADHD, “affect regulation”, etc. 4) Possible “selection bias”.**** Do you choose to drink only when you’ve finished your work and have a chance to relax? What day of the week? For a real experiment, prospectively randomize 5-10 of the next 50 days on which you will drink. Cancel and move these days only if you will be unavoidably driving. Randomize day of week, work load, hydration status. Keep everything else the same. Drink at home vs going out and getting laid. Same music and energy level. Don’t watch politics, etc. Rate your mood with a Beck Depression inventory or something. Measure blood biomarkers. SIADH, ADH, vasopressin. Bone marrow production, etc."
    ],
    "cons": [
      "You must be young and/or havent drank much alcohol in your life. I was the same way in my teens when I first started drinking but as I got older and continued to drink, your body changes and hangovers become more prevalent and intense. Alcohol is a poison and as you age and ingest more poison, your body gets worse at processing it.",
      "Maybe because acetaldehyde is thought to be also addictive, gives you dopamine. The poisonous metabolite of alcohol. Maybe also the anxiolytic effect of alcohol. But in the long term it increases anxiety, so it really is a bad drug.",
      "The sugar has metabolized. As you age your body will stop doing this as effectively and this will turn into feelings worse than death.",
      "Is it also a day off work? Maybe you don’t have to go to work? Also definitely still drunk, enough sedative in you still before the anxiety and stress chemicals of withdrawal/hangover launch their offensive and real life comes flooding back in like boiling sewer water."
    ]
  },
  {
    "title": "Minerals' neurological functions",
    "permalink": "https://www.reddit.com/r/Biohackers/comments/1lfjpmy/minerals_neurological_functions/",
    "pros": [
      "Thanks for posting in /r/Biohackers! This post is automatically generated for all posts. Remember to upvote this post if you think it is relevant and suitable content for this sub and to downvote if it is not. Only report posts if they violate community guidelines - Let's democratize our moderation. If a post or comment was valuable to you then please reply with !thanks show them your support! If you would like to get involved in project groups and upcoming opportunities, fill out our onboarding form here: https://uo5nnx2m4l0.typeform.com/to/cA1KinKJ Let's democratize our moderation. You can join our forums here: https://biohacking.forum/invites/1wQPgxwHkw, our Mastodon server here: https://science.social and our Discord server here: https://discord.gg/BHsTzUSb3S ~ Josh Universe *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Biohackers) if you have any questions or concerns.*",
      "Chromium is often sold together with vanadium, so it would have been nice if the author added a row for it to his table. Manganese is also quite important for, among others, its involvement in Manganese SuperOxide Dismutase, and for its regulation of arginase, the enzyme controling the processing of arginine."
    ],
    "cons": [
      "Chromium always seems interesting but I’ve read some concerning stuff about it and cancer risk."
    ]
  },
  {
    "title": "My sleep-deprived mom brain cost us our savings. I think I’m in shock.",
    "permalink": "https://www.reddit.com/r/NewParents/comments/1lfbfk8/my_sleepdeprived_mom_brain_cost_us_our_savings_i/",
    "pros": [
      "I understand you’re tired and I understand mom brain completely but honestly at eight months it shouldn’t be so bad. You really dropped the ball and I believe this would’ve happened to you even if you didn’t have mom brain. Use your common sense and try your best not to get overwhelmed so easily. Since this was your fault, then you must put in as much effort as possible to get this fixed. Don’t you just accept that it’s gone. Called the FBI. Call lawyers. The bank should be helping. Don’t just roll over and accept it. The police have abilities to look these things up, they just don’t want to spend the money. You must insist.",
      "Oh my god. Sending you strength. It will get better. You're so brave.",
      "I am so, so sorry this happened. I absolutely feel like I would have done the same thing back when I was sleep deprived and running on fumes. You aren't stupid or foolish, you were vulnerable. They're professional scammers preying on people who are vulnerable in one way or another - be it an elderly person whose mental faculties are slipping, or a new parent who hasn't had a good night's sleep in weeks. I'm sure you've already reported this to your bank and filed a police report, and I hope there's a means of recovery. It's a loss but please try not to be hard on yourself. I'm glad your husband is being supportive.",
      "If it makes you feel any better, my best friend fell for a similar scam and she’s single and doesn’t have any kids. They are really conniving and convincing. I’m sorry that happened!",
      "You are SO not alone with this!!!! Incredibly smart people are victims to scams like this all of the time. These scammers are incredibly skilled at what they do. It is not just a pastime or something they do as a joke, this is a full time career for them. Please please please escalate this with your bank. Continue to advocate for yourself. You are a victim here. Just because they said no once doesn’t mean you should stop escalating. Be polite, be professional but be insistent on speaking to someone who can help you. Continue to escalate higher and higher until you get as high as you can possibly go. Request to speak to the ombudsman or escalate it to the external bank regulator in your country (hopefully there is one). Go to the press if you need to. A financial institution does not want bad press and this may get the attention of the people who need it see it. Please do not be deterred by fearing people will judge you, so many people fall victim like this but are too embarrassed to say anything so everyone thinks they are the only one. You are not the first and you won’t be the last. Be one of the voices who help educate others. Do not let your pride get in the way of fighting for you life savings ❤️"
    ],
    "cons": [
      "I'm so sorry this happened. When my son was about 6 months old I got scammed for $300. I got a fb msg from who I thought was hubby's aunt, so I foolishly sent money (turned out her account had been hacked). I should have called her and been suspicious of the email for etransfer, I kept asking what it was for , they said kitchen stuff and Thanksgiving stuff. Canadian Thanksgiving is in October and it didn't click we already had it. Everyone on her fb was sent a msg and obviously angry. My bank did not reverse it and it made the budget tighter. I felt so stupid and cried for days, especially when the bank refused to reverse it.",
      "While I was pregnant I very nearly fell for a scam where someone called me pretending to be a police officer and they said I had a warrant because I missed jury duty. They wanted me to pay a fine to avoid jail time and I was going to take them money until they asked me to stay on the phone with them while I drove to the bank and to drop it off at a kiosk instead of the county clerk. That’s what finally tipped me off after I’d already been on the phone with them for 30 minutes! Pregnancy and especially motherhood will have you all out of sorts with anxiety and sleeplessness! I’m sorry this happened to you, that’s just terrible 😞. Don’t beat yourself up, and I hope you can get your money back.",
      "I stupidly sent a few etherium to a scam wallet disguised as a giveaway from a famous person who has been known to do such things, when my first two were toddlers and my wife and I were zombies. Within 10minutes a realized it was a scam. But once crypto is sent, that’s it. There’s no recourse. Those Eth would have been worth tens of thousands of dollars if we still had them. It happens! My advice: don’t have any money in crypto that you can comfortably afford to have vanish at any point in time. And never count on getting back what you invest in a crypto. Consider it gone the second you buy. Or, just don’t mess with crypto at all. It’s mostly a scam at this point.",
      "Oh my God. You are the victim in this situation. Don't forget that the fault lies with the thieves and scam artists",
      "Im so sorry. I almost got scammed when my baby was around 8 months. I was exhausted. Got a call from the city police department (yes it showed up like that on my phone) that a warrant was out for my arrest because I missed a court date or something. It was absolutely terrifying I couldn't stop sobbing. I finally had enough calm to google the situation and found an article about that exact scam. Still so scary!"
    ]
  },
  {
    "title": "Tiktok creators talking to their babies - performative?",
    "permalink": "https://www.reddit.com/r/NewParents/comments/1lfi0jp/tiktok_creators_talking_to_their_babies/",
    "pros": [
      "Who cares what influencers are doing on the internet, but definitely talk to your baby. Sing to them, play them music, repeat their coos back to them, read them recipes as you are making dinner. Do all of it! We can’t spend every moment making eye contact with our infants and speaking slowly, but the more language we expose them to, the better their little brains develop! I sang the entirety of Sublime 40oz to Freedom to my 2month old yesterday. She loved it.",
      "I see your point but I actually love them. I’m home alone all day with a baby and I struggle to come up with endless talk as a naturally quiet person, so they’ve inspired me to start telling him all sorts of gossip and stories! I also noticed that he loves it when I talk to him in the mirror, which I guess is the same as the phone.",
      "I mean, I have videos of me talking to my baby too and obviously my phone is out to film it, but I spend 99.9% of the time talking to her face to face without my phone. I’m sure even people who create content put their phones down to talk to their babies most of the time :)",
      "Almost everything on social media is performative by nature lol. There is no way to set up a camera, get good angles/lighting, etc. and have a completely genuine and spontaneous video lol. It's easy to be parent of the year for 2 minutes on tiktok.",
      "I am happy I never got on TikTok. I’m a 1987 millennial, and I always felt too old for it. Doesn’t sound like it would help my mental health."
    ],
    "cons": [
      "I hate that concept with a passion. They’re using their babies for clout and the babies grow up with a phone stuck in their face. Later they’ll film those fake videos of the toddler/kid giving funny/snappy comments and comebacks and they’ll be just as fake. And I’d be pissed if I found out my parents put my baby/child face all over TikTok or other public platforms anyway.",
      "Reading to / talking to / narrating to your baby helps them develop. You probably shouldn’t argue that more of that is bad. At the same time! Social media is poison, especially for children. At the same time! High contrast / low impact media (low value - it holds their attention but they don’t learn) is proven to impede development of the brains executive functioning capabilities. I’d say, fairly objectively, its a horrible idea to use social media to teach language to your children. Even as a very small part. Watch the documentary “Can’t Look Away” if you don’t believe me.",
      "I don’t use TikTok but I see the same thing on Instagram and always wonder if that’s the only time they really talk to their babies/kids, like if the camera stops rolling, do they actually take the time to talk to their babies? It’s sad but for some influencers I would bet once the camera stops, so does the interaction.",
      "Shit Tok is by definition. Performative.",
      "TikTok creators being performative? Outrageous allegations!!"
    ]
  },
  {
    "title": "The six-week hiatus after giving birth seems to have made my husband oblivious in the bedroom.",
    "permalink": "https://www.reddit.com/r/beyondthebump/comments/1lfdn16/the_sixweek_hiatus_after_giving_birth_seems_to/",
    "pros": [
      "It can be so hard to have those awkward conversations, but I think it’s really important that you address this with your husband before it starts building resentment or you get hurt. Based on your description, it sounds like he’s just not yet in sync with you yet. There’s nothing to be ashamed of in that, though. You know he’s not doing it on purpose and you don’t want to make him feel bad about it, but you have to let him know so that he can change. Tell him you have something you’d like to share with him, and you’re feeling a bit awkward about it so you need him to listen openly and without interruption. Tell him that you love that he finds your postpartum body so sexy, but that you need him to be a bit more mindful with you during sex. He’ll likely respond by feeling bad and apologizing, and then you guys can move on. If he gets too down on himself, tell him how he can make it up to you.",
      "I think it’s all about framing. One idea: “Sex with you is so fun and amazing, and I just want to be able to really pay attention to you instead of being on guard. Can you be more careful so I can be in the moment?”",
      "When I need to have a hard conversation, I sometimes start by saying “I wanted to say some things and I really really would appreciate it if you could just listen to the whole thing without interrupting or getting defensive.” You can even say “this is kind of embarrassing/awkward to even bring up.” And then go into how you were excited to get back to being intimate after postpartum, but are finding things are different with your postpartum body and needs, and for the first little bit, you just need him to be more aware of your body. Honestly I’m also awkward with talking about what I want during intimacy with my husband, and we’ve been married 10+ years, so it’s not only you!",
      "What kind of porn is this man watching? Cause when they change randomly like that, that is always my first thought. 😅😅",
      "Sandwich it. Compliment, please don’t do X, compliment. My husband is a huge boob guy and I had to put the kibosh on that post partum while breastfeeding because I did NOT enjoy it. I worried it would cause long term issues but nope! As soon as I stopped and gave him the go ahead he was right back at it 😂"
    ],
    "cons": [
      "Communication before you get hurt. Remind him hey can you be more aware of areas xyz or how you maneuver us around please remember I just had a baby etc. Things are good but they are sore if you touch them in xyz kinda way etc Like I had very painful to touch skin everywhere. Even strechmarks hurt etc. I also had 2 back to back c-sections then rectal surgery etc my body and ligaments felt different for so long etc. These were things inhad to remind my SO of. Also to not put so much pelvic pressure etc. Cause yeah they seem to forget or are worried about their performance or chasing pleasure etc.",
      "This is probably a cop out, but before sex I would stop him and say “hon, my postpartum body isn’t up for rough sex yet. The last several times have been uncomfortable and unpleasant for me. I need you to slow down and pay attention when I tell you something isn’t comfortable.” I know it’s probably my conflict avoidant personality but I would be trying to find a way to communicate my needs that didn’t sound critical of him or make him seem like he forgot how to make love. Even though apparently, he has.",
      "Just tell him. The fact that you are worried about telling him when he is hurting you is insane."
    ]
  },
  {
    "title": "When you're trying to be low-key pregnant but your toddler has other plans",
    "permalink": "https://www.reddit.com/r/BabyBumps/comments/1lf91yc/when_youre_trying_to_be_lowkey_pregnant_but_your/",
    "pros": [
      "Gotta love their ability to not keep their cool 😂😂 My two year old went through a few weeks where he’d get mad if I asked him about the baby in my tummy and insist it was in his. But then the other day I was lounging back a bit on the couch so my 24-week belly was really protruding and he went “whoa!!!!” And was a little obsessed with it and now gives it kisses so I think we’ve made progress? Lol",
      "My daughter is 2.5 and still slowly accepting The idea mom has a baby in her belly. I would Love for her to be this excited but she’s not 😂 I tell her all the time. What a cute moment though",
      "I think it's the best announcement!!! (And congratulations!)",
      "That's going to be a great family story. We told my 2yo on holiday and didn't facetime the family because we thought she might spill the beans That Christmas, I gave my mum a framed ultrasound pic. She looked at it confused and 2yo chirped up \"It's the new baby\" which was such a perfectly scripted announcement",
      "My kids told EVERYONE at church when we were expecting our fourth, so the whole congregation knew really early on. It was funny and everyone was like \"we've been there\". I will say i appreciated not having to actually announce or tell people cause they did it for me."
    ],
    "cons": [
      "Wait a minute 😭😭😭😭 CAN WE NOT HAVE COKE??? Im 23 weeks and fizzies have really helped tonssss with reflux n motion sickness",
      "😂😂😂 I did decide to wait to tell my 2 year old about the baby in my belly until I was ready for her to spill the beans, but it's SO HARD not to tell them first trimester to explain why Mom is so sick and tired and laying in bed a lot 🥲"
    ]
  },
  {
    "title": "HELP! What are these worms and how to get rid of them?",
    "permalink": "https://www.reddit.com/r/CleaningTips/comments/1lf6zub/help_what_are_these_worms_and_how_to_get_rid_of/",
    "pros": [
      "I could be wrong but they look like flour or mold mites to me, if mold mites they'll be breeding in mold or if flour mites,they can come in from infested flour/ grains etc. If they're in a cupboard you'll likely need to throw out everything that they could get into (like packets of food) and ensure everything in future is put in airtight containers. A quick google search says you can clean the area thoroughly with hot soapy water, or use hot water and bleach, or a last resort a pesticide. Let the area dry fully before you put anything back. Make sure you throw the cloth out that you've cleaned them with as any live ones will multiply anywhere! I struggled with mold mites in an extremely damp house I rented for a year and it wasn't fun trying to combat them. Hope this helps a bit.",
      "They look kinda like grain mites. We used a grain based cat litter for awhile and then we got these. Luckily we didn't have the litter/litter box in the kitchen otherwise everything in the pantry would've had to be tossed. What room is this in? Do you have anything in that room that could be considered a food source for mites? Cleaning wise, vacuum, dispose outside immediately, hot water bath vacuum components (rollers, canister, filter if it's a reusable one) and then try a steam cleaner, if you have a carpet/ rug nearby use a carpet cleaner. For surfaces, diluted bleach if the surface can handle it.",
      "These are mites. Context would help with id, and as others have suggested, the what's this bug sub would be a better place to post. Give them more details on location (house, shed, pantry, under a big plant, etc.), and hopefully they'll come up with a good fix.",
      "So in my experience of being a reptile keeper, toward the beginning (around 3 years ago) my fruit fly cultures would form these tiny creatures. After loads of research, I finalized my decision, concluding these are grain mites. And they suck. Best bet. Use cleaner with force. I recommend some pinesol. Wipe down and clean anything they're on. If possible, wash with hot water and soap in the sink.",
      "r/whatisthisbug would be a better resource. Probably going to need a closeup still photo of them in macro mode as well for a better identification"
    ],
    "cons": [
      "Spraying isopropyl alcohol (IPA) kills most pests on contact. You can also try dishwashing detergent diluted in water. As far as I know, the suds don’t affect maggots much, but they can kill many pests and temporarily paralyze flies. A single drop of IPA is enough to kill a fly.",
      "Hi! Those are termites!! Heres how to get rid of Infestations: - Liquid Termiticides (e.g., Termidor): Applied around your home to kill or repel termites. Bait Stations (e.g., Sentricon): Placed in soil; termites eat poisoned bait and carry it back to the colony. - Boric Acid: Kills termites by disrupting digestion; apply to wood or cracks. - Diatomaceous Earth: Natural, non-toxic powder that damages termites’ exoskeletons.",
      "Does it matter what it is? Kill it with fire!🔥",
      "I had these crawling in my house before, they are flour mites. Find the source- get rid of it and hire an exterminator to poison the hell out of your appartement.",
      "Jesus Christ the level of misinformation in this thread is saddening. The little difficult to tell from these photos but that is a type of mite. Could be a Spider-mite call a local pest control company they're not going to bite you or destroy your house but they're super annoying and they breed in vast quantities"
    ]
  },
  {
    "title": "Is this mold / should i be concerned",
    "permalink": "https://www.reddit.com/r/CleaningTips/comments/1lfemw8/is_this_mold_should_i_be_concerned/",
    "pros": [
      "I had the exact same issue in my vents (but it was gray, not black) + a musty/mildewy smell whenever the AC was on. I asked maintenance to check it out, and they swore it wasn't mold and must be dirt and left it alone. I insisted they come back and double-check it. They tested it, and yeah, it was mold. They had to replace the whole ventilation system thingy. I highly recommend asserting to them that this needs to be taken seriously and taken care of. Renters have the right to a healthy and safe living environment!",
      "Hello, good afternoon, happy Thursday. In my opinion, more than worrying is taking care of yourself. Clean well with bleach or vinegar. Wear gloves and a mask. You should buy a dehumidifier. In your apartment you must have a lot of humidity. 🥴🥴🥴",
      "I have a high tolerance for cleaning dirty stuff. This isnt bad. You can disinfect with bleach by scrub and dunking all the submersible parts. Not a hard job. But I don't think it would give me the confidence how clean it is since that thing's job is to blast AC to everyone.",
      "UPDATE: I contacted our maintenance team again and they sent the “manager” out to look, he came and he explained that its not mold and wiped it away with his finger. He said mold cant organically grow on plastic and its all plastic. and if it was mold it would be growing all on our bedsheets (our bed is less than a foot away from the airconditioner / but not covering it) he said he has seen other units worse and covered all the way to the outside of it. He even tested the humidity and said it was too low to start the growth of mold I will take some of the recommendations and clean it with a mask and gloves to be safe but i feel a bit more at ease.",
      "I just got a notification of a recall order for an AC that that I have purchased for this exact issue. Good luck! https://www.cpsc.gov/Recalls/2025/Midea-Recalls-About-1-7-Million-U-and-U-Window-Air-Conditioners-Due-to-Risk-of-Mold-Exposure"
    ],
    "cons": [
      "I SERIOUSLY hope you document everything, in case of something happening to you all living there. Sick, or hospitalization, or WCS; death. So that would be able to take legal action if it ever came down to it. This is excessive and dangerous!! You can get so sick from mold exposure, it can cause infections, and in bad cases - poison your blood!",
      "I just had a similar issue with my ac although not as bad as yours. I made a plastic tent around it, took mask, gloves, glasses and old clothes I could throw away afterwards on and took it apart, soaked all parts in bleach and sprayed everything down that couldn’t be dismantled so it was totally soaked, I continued spraying for 3 days and cleaning with wipes etc until everything was gone. It was A LOT of work, but its absolutely gone now and don’t smell anymore. I used a test strip after a week, it was negative for mold. (English is not my native language)",
      "Def mold and worst yet it’s being blasted all over cause of where it’s located, which means it’s spreading it all over.",
      "I had something similar happen to me. We noticed our AC in the bedroom had an odd smell, and saw there was mold. Informed the office and they send someone to “clean” it. The unit still had a smell, so they sent a maintenance guy to check it out, he told me “you didn’t hear this from me” and showed me a picture of inside the AC. It looked like what yours does. So I went to the office asking if they could deal with the issue. After I got back home from work, I noticed the AC unit was running (I had turned it off for obvious reasons) and saw someone put an air freshener in there to mask the smell. I basically stormed to the office and demanded something be done. Showed management pictures of everything. Threatened to call health inspectors. They replaced the unit the same day.",
      "On today's episode of retarded questions..."
    ]
  },
  {
    "title": "Large water bottle that doesn’t have stainless steel",
    "permalink": "https://www.reddit.com/r/BuyItForLife/comments/1lfbrnh/large_water_bottle_that_doesnt_have_stainless/",
    "pros": [
      "I love my [Camelbak Chute 50oz](https://www.camelbak.com/bpa-free-plastic/chute-mag-50oz-bottle-with-tritan-renew/CB-2468.html?dwvar_CB-2468_color=Charcoal). It is easy to clean, easy to fill, easy to guzzle from, and takes a fall like a champ.",
      "Nalgene is top notch, Nike and Under Amour also make bottles that are 1 gal and for the fitness crowd look pretty cool too. Yeti has a solid bottle called the Yonder - might be able to snag one on sale since those are looking like they may go away. Good quality just don’t sell well.",
      "I like drinking out of glass water bottles (I work in an office). Not as durable as Nalgene but more enjoyable experience for me. I use neoprene sleeves with mine. Search \"borosilicate glass water bottle\" on Amazon for examples.",
      "I have both a Yeti and a Nalgene. Both are great, however the Yeti has a smaller mouth which I prefer. Comes in a variety of sizes as well.",
      "Nalgene is my first instinct. But look at camelbak too. If you want double wall take a look at Tervis, not sure they will be big enough but they won't sweat with ice if that's his thing. Is it about noise? Will they accept a hydroflask with a boot? IMO alu will probably be considered SS and not allowed. There's also Lifefactory glass water bottles (they come with a silicone sleeve) I'm sure that's poking the bear though."
    ],
    "cons": [
      "I see people talking about outdoor activities, but if its just office, just get him a plain simple IKEA 1.5L Water bottle out of glass. I have broken 2 glass water bottles in 5 years, I take it everywhere IN my backpack. Never on outdoor trips or something the like. But thats not really a gift. Water out of glass, I try to never drink from plastic cups or bottles.",
      "I use a camelbak water bottle. Quite large, but it's not wide mouthed like nalgenes so I'm not spilling as much. The mouthpiece has a cap that is both screw on and also magnetic, so when I'm sitting at my desk I can just pop the cap off instead of unscrewing it every single time."
    ]
  },
  {
    "title": "Doggy bag dispenser repurposed to spool random rope.",
    "permalink": "https://www.reddit.com/r/Frugal/comments/1lfak8g/doggy_bag_dispenser_repurposed_to_spool_random/",
    "pros": [
      "We always used those Countrytime Lemonade containers. Just drill a hole in the top and great for keeping the garden twine",
      "Oh dang, that would be a great idea for paracord. Should hold at least 50 feet.",
      "Brilliant. Going to repurpose for my garden twine"
    ],
    "cons": [
      "This is genius. Am stealing."
    ]
  },
  {
    "title": "Freebies you wouldn't think of",
    "permalink": "https://www.reddit.com/r/Frugal/comments/1lfe0x5/freebies_you_wouldnt_think_of/",
    "pros": [
      "You can still find liquor stores in many areas that will give away their used alcohol shipment boxes for free. I know several people who've benefitted from this particular freebie when in need of moving boxes -- very sturdy, too, since they had to ship liquid+glass originally.",
      "Another good source is pickle buckets from restaurants. Smaller and locally owned are my goto. Always just ask nicely and usually get a couple.",
      "Starbucks will give you free coffee grounds for your compost. It's extreamly nice,and great for the environment, I can't afford their coffee, but they have a bucket where I can just pick them up to grow my own food."
    ],
    "cons": []
  },
  {
    "title": "Experience with reusable period underwear/pads?",
    "permalink": "https://www.reddit.com/r/ZeroWaste/comments/1lfcuk6/experience_with_reusable_period_underwearpads/",
    "pros": [
      "I’ve been using cloth pads and recently bought a few pairs of period underwear. I also have a menstrual cup but I have gained weight and have a hard time getting it in and out than I did before I loved it but don’t use it much at all anymore. The reusable pads are amazing and I love them- the period underwear doesn’t work for my very heavy days but I can double up on pad and underwear too and it’s nice. For swimming on a period I do use a one time use tampon but only rarely as I’m not a swimmer on my period often personally. I’ve used cloth pads for eight years and they have paid for themselves many times at this point. They feel less plasticy and sweaty than one use pads- I didn’t realize how plastic the one use pads felt until I had to buy some one a trip for an unexpected period (I now pack a few cloth pads for trips no matter what now) and the one use plastic was awful when I tried them again for that trip. It felt suffocating down there. When/ if you get cloth pads make sure to get different sizes they make a panty liner size and it is lovely for spotting. I have periods from hell with how heavy they are and the mega pads are great and unless I’m wearing tight thin clothes they don’t show through ever- even in my daily wear of all colors of yoga pants. They don’t ride up your backside like plastic pads do- they don’t even go up as far at all- and I’ve never had leaking issues. Start trying some panty liner size ones- like 2-3 and use them for end of period or beginning of period spotting to try them out. They’re also great for reducing the possibility of yeast infections from working out because they are easy to use while working out then you can just take them off and you have no sweat on your underwear.",
      "I only use period underwear at this point. I use the period company brand. I absolutely love the fit, I've never had a leak even on my heaviest days and I've been using them for over 2 years, my oldest pairs are still going strong and just as absorbent as they were when I bought them. You don't get that wet feeling when you wear them. The don't feel bulky or like they stick out the same as when you wear a pad. They have plenty of different styles for women, including thongs and boxer briefs. They even have specific ones meant for wearing overnight on your heaviest flow days. I really cannot say more good things about this brand and its products because I find them to be incredibly good quality. The best part is they aren't even that much money and pay for themselves within a couple months of use. They also often have sales. They're super easy to wash, straight in the washing machine and dryer. 100% I recommend them to every person who bleeds down there because they are the best as far as I'm concerned. Also now Walmart sells them which is amazing because their online store is always sold out lol.",
      "I get mine from tree hugger cloth pads and have had them for about 5 years. When I first got them I’d prewash them when taking them off to avoid staining, but the past few years I don’t care and just throw them in my laundry and wash them with everything else. They’re stained but don’t smell or anything. Honestly the best decision I’ve made, getting cloth pads instead of literally anything else. They’re sooo comfy and they’re super easy to clean",
      "I use Lil Helper reusable pads. I quite like that you can get many different lengths, with or without wings, and they will hold a lot of liquid. They are also machine washable, but I hand wash them, it's easy to do it. They are hard to stain & even if you do, it barely shows. They offer discounts to try them & if you can't really afford them, they will sell at a discount without proof required. They also have awesome mats called lifesaver mats that will save your mattress if you are someone like me who will leak past the back of a pad every time because it just wicks up the butt crack The mat doesn't move, is comfy & machine washable too! https://lilhelper.ca/",
      "I've had my period undies for almost 10 years. They're a little bleached atp, but hey, they're period underwear, right? The label says not to put them in the dryer, but I'm ungovernable, so I do anyway and they're fine. They're Thinx, I think. I also have a June menstrual cup that works really well and was very cheap when I bought it ($6.99 \"going out of business\" sale). I used to get super heavy periods (before my current BC and hormone regimen), so I used both out of necessity. Now I use both just out of habit, plus they're both very comfortable and make me feel completely secure. I've tried both disposable and reusable disks, but they've never worked for me. Way too leaky, slipping out of place, and super messy. I like the June cup because it has a little knob at the end that you can pull on without having to stick your fingers completely inside yourself to retrieve it, and you can neatly empty it into a toilet or shower."
    ],
    "cons": [
      "The saalt disc and bambody panties are the dream. I wish I'd had them my entire menstruating life instead of just the very end. Why bambody? The fabric is as little synthetic as can still be functional. I hate the slinky, sweat trapping not cotton, shudder. But more importantly, the protection goes band to band. I paid hundreds of dollars, trying all of the brands. The absorbent layer stops so low in front that I bleed over them. They are comfy enough that my daughter and I wear them every day. They are just our undies. I didn't have enough cycles to try more cups/discs etc. But the handful of times I used the salt disc, it was life changing. Like I wasn't even bleeding except when I peed. Put it in, dumps when I sit on the toilet. I did have a hell of a time getting it out, needs more than just a lip.",
      "I use the saalt menstrual cup. I’ve had two children and am on hormonal birth control, so ymmv, but I can use it every day of my period. I dump it out more frequently on heavier days, but if I have it in right, it doesn’t leak. When I empty it in the toilet, I just wipe it out with toilet paper and re-insert it. I sanitize it by filling a mug with water and microwaving it for 3 minutes.",
      "I use bambody period underwear. I think I have 10-12 pairs. I usually just use 7-8 though, per period. They've been life changing for me--I just have to change them every 24 hours, sometimes every 12 hours the first day or two. My period is on the lighter side, though I could imagine they might be a pain in the ass for someone with a heavy flow.",
      "You've already had some great feedback here, but I just wanted to mention a specific issue I experience with period underwear that I don't often see discussed. They make me sweat like crazy. They cause awful swamp ass for me, and I'm not generally a hugely sweaty person. it could be that other brands would be fine, but I wanted to mention it.",
      "I started with pads and now use them as liners from my discs, started out with a lumma disc, which worked with the pads, but too soft to wear on its own- I had an accident as a consequence one Christmas, so I got a firmer one from pixie cup Pads get stored in a bag or bucket till I get to wash them, I put in in on a quick wash and then add my clothes, that way I don’t have to leave them in the bathroom"
    ]
  },
  {
    "title": "What to do with excess reusable water bottles and cups?",
    "permalink": "https://www.reddit.com/r/ZeroWaste/comments/1lfc170/what_to_do_with_excess_reusable_water_bottles_and/",
    "pros": [
      "Not from my school, but a food rescue org I work with got 3 huge plastic bags of water bottles like these we couldn’t distribute. I found another local org who used these for a fill-a-backpack type event",
      "Depending on the size, I use some that are missing lids for houseplant cuttings that I want to grow into their own plant. Other uses mentioned for pens/pencils work great too and if you have pegboard you can get the holders to arrange them neatly. I have also used the plastic water bottles for starting plants after drilling holes into them.",
      "I run a food rescue organization and recently started collecting water bottles to give out to our unhoused clients. Maybe there’s something in your area?"
    ],
    "cons": []
  },
  {
    "title": "Microcurrent + RF (like Skorr Glow) it works! But why?",
    "permalink": "https://www.reddit.com/r/SkinCareScience/comments/1l8suh5/microcurrent_rf_like_skorr_glow_it_works_but_why/",
    "pros": [],
    "cons": []
  },
  {
    "title": "Laser hair removal + azelaic acid 15% – is it safe?",
    "permalink": "https://www.reddit.com/r/SkinCareScience/comments/1l6llay/laser_hair_removal_azelaic_acid_15_is_it_safe/",
    "pros": [],
    "cons": []
  },
  {
    "title": "Nothing works.",
    "permalink": "https://www.reddit.com/r/SkinCareScience/comments/1l63h8l/nothing_works/",
    "pros": [],
    "cons": []
  },
  {
    "title": "Eye serum?",
    "permalink": "https://www.reddit.com/r/TheOrdinarySkincare/comments/1lfegpp/eye_serum/",
    "pros": [
      "Not by The Ordinary, but Beauty of Joseon Retinal eye serum is great! Only to be used at night but it looks very well rated by people with similar concerns",
      "Thank you for posting. * The best place for beginners to start is The Ordinary's official [Regimen Builder](https://theordinary.com/en-us/regimen-builder.html) which provides customized advice based on your skincare needs. * You can also [contact Deciem customer service](https://deciem.com/en-us/contact-us.html) for routines and advice * Pay attention to Deciem's recommendations for time of day to apply. Products with night only can cause photosensitivity (sun damage) if used during the day * Be careful with acids: Overuse can damage the skin's barrier. Always patch test and follow the product's instructions. * Make sure you use sunscreen daily. * You can check if your products should be used together using our [Routine Builder](https://www.myroutinebuilder.com/ordinary) tool * If you have a list of products you want to use, we also have a [Routine Generator](https://www.myroutinebuilder.com/ordinary/scheduler/) tool and an [AI chatbot](https://chatgpt.com/g/g-683b0fec1d4881919040ad52907e97e4-my-routine-builder) * To ensure authenticity, [order through Deciem or one of their approved stockists](https://deciem.com/en-us/find-us). If you have a question about the authenticity of a product please post in our companion subreddit [/r/TheOrdinaryRealOrNot/](https://www.reddit.com/r/TheOrdinaryRealOrNot/) * The Ordinary products/Reddit are not a substitute for a dermatologist. If you have a medical condition like acne, dermatitis, etc. you should consult a dermatologist before using any products. * Check the sidebar/community info for rules and skincare information. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheOrdinarySkincare) if you have any questions or concerns.*"
    ],
    "cons": []
  },
  {
    "title": "Amelia",
    "permalink": "https://www.reddit.com/r/Sephora/comments/1lf0xp4/amelia/",
    "pros": [
      "F Amelia. I hope she has the day she deserves!!’"
    ],
    "cons": [
      "wtf!!! I’m so sorry",
      "I wonder if it's a person you know? Only cause all you really need to use points in store is an email or a phone number. They dont ask for ID proof of your name or anything. I mean I know friends who order loads of stuff at Sephora and technically I could go in and just give them a phone number and use their points. But, who does that! Also, can you see any of the info of the girl who bought stuff on your account? Like credit card name or anything? edit- I saw earlier in the day a girl on Tik Tok saying a random girl ordered things on Ultra's website using her account points!!! Idk how that works though online... but the girl whose points where stolen got an email showing that her points were used and the name/address the items are being sent too. So, there is proof! Now, if the thief of points was smart she would have picked up the stuff in store so no name proof was disclosed.",
      "5k points? What a monster, how did she even get your information! I'm so sorry 😞",
      "I have had sort of a similar thing happen to me and I am at a loss for as to what I should do about it. Someone redeemed my birthday gift at sephora. It wasn’t me or anyone I know. I got a mail about it but it doesn’t show up on my order history. I naturally contacted customer care to inform them of the anomaly and they told me they will escalate the matter to other department and haven’t updated me since. Should I inquire about it again or escalate it again? Its not the birthday gift I regret losing out on but the fact that somebody stole from my account?",
      "Wow wtf! They can’t go into their system somehow & see that there was a name change? That’s so messed up, I’m sorry this happened to you!"
    ]
  }
]